Repository: adamayoung/TellTheTime
Catalog: Shared/Resources/*.lproj/Localizable.strings
Languages: es

source: What's the time?
es: ¿Que hora es?

source: New time
es: Nuevo tiempo

source: Settings
es: Configuración

source: Close
es: Cerrar

source: Clock Display
es: Visualización del reloj

source: Show minute guide
es: Mostrar guía de minutos

source: Show digital clock
es: Mostrar reloj digital

source: Time
es: Hora

source: Round to the nearest 5 minutes
es: Redondear a los 5 minutos más cercanos

source: Manually set time
es: Establecer la hora manualmente

source: past
es: y

source: to
es: menos
